In [1]:
import pandas as pd
import sqlite3

con = sqlite3.connect('Data.sqlite')
dfs = pd.read_excel('Data.xlsx',sheet_name=None)
for table, df in dfs.items():
    df.to_sql(table, con,if_exists='replace',index=False)
con.commit()
con.close()

In [2]:
%load_ext sql
%sql sqlite:///Data.sqlite
#%sql postgresql:///postgres:password@localhost:5432/postgres
# Turn off echo of connection information
%config SqlMagic.displaycon = False
%config SqlMagic.feedback = False

## UNION vs UNION ALL

|UNION ALL|UNION|
|---|---| 
|selects all the values|only distinct values are selected (eliminate duplicate rows)|
|faster|slower|

## HAVING vs WHERE Clause

|HAVING|WHERE|
|---|---|
|can be used with aggregates|works on rowâ€™s data, not on aggregated data|

In [3]:
%%sql
SELECT name
FROM sqlite_schema
WHERE type ='table' AND name NOT LIKE 'sqlite_%';

[('yelp_business',),
 ('db_employee',),
 ('db_dept',),
 ('fb_friend_requests',),
 ('fb_eu_energy',),
 ('fb_asia_energy',),
 ('fb_na_energy',),
 ('amazon_transactions',),
 ('facebook_friends',),
 ('customers',),
 ('orders',),
 ('facebook_web_log',),
 ('sf_transactions',),
 ('ms_user_dimension',),
 ('ms_acc_dimension',),
 ('ms_download_facts',),
 ('ms_employee_salary',),
 ('marketing_campaign',),
 ('airbnb_search_details',),
 ('facebook_employees',),
 ('facebook_hack_survey',),
 ('employee',),
 ('sf_restaurant_health_violations',),
 ('yelp_reviews',),
 ('worker',),
 ('title',),
 ('salesforce_employees',),
 ('member_count',),
 ('member_joined',),
 ('cb_salary',),
 ('cb_companydivisions',),
 ('cb_vendor',),
 ('cb_vendorinformation',)]

## 1. Salaries Differences
Write a query that calculates the difference between the highest salaries found in the marketing and engineering departments. Output just the absolute difference in salaries.

In [4]:
%%sql
WITH table1 AS (select *
                from db_employee e1
                join db_dept e2
                on e1.department_id = e2.id)
select abs(max(case when department = 'marketing' then salary end) - max(case when department = 'engineering' then salary end)) salary_difference
from table1

[(2400,)]

## 2. Acceptance Rate By Date
What is the overall friend acceptance rate by date? Your output should have the rate of acceptances by the date the request was sent. Order by the earliest date to latest.

Assume that each friend request starts by a user sending (i.e., user_id_sender) a friend request to another user (i.e., user_id_receiver) that's logged in the table with action = 'sent'. If the request is accepted, the table logs action = 'accepted'. If the request is not accepted, no record of action = 'accepted' is logged.

In [5]:
%%sql
with table1 as (SELECT date,
                    user_id_sender,
                    user_id_receiver
                FROM fb_friend_requests
                WHERE action='sent'),
    table2 as (SELECT date,
                    user_id_sender,
                    user_id_receiver
               FROM fb_friend_requests
               WHERE action='accepted')
               
select t1.date,
        ROUND(cast(count(t2.user_id_receiver) AS float)/cast(count(t1.user_id_sender) AS float),2) AS percentage_acceptance
from table1 t1
left join table2 t2
on t1.user_id_sender = t2.user_id_sender
and t1.user_id_receiver = t2.user_id_receiver
group by t1.date

[('2020-01-04 00:00:00', 0.75), ('2020-01-06 00:00:00', 0.67)]

## 3. Highest Energy Consumption
Find the date with the highest total energy consumption from the Facebook data centers. Output the date along with the total energy consumption across all data centers.

In [6]:
%%sql
WITH total_energy AS (SELECT *
                    FROM fb_eu_energy eu
                    UNION ALL SELECT *
                    FROM fb_asia_energy asia
                    UNION ALL SELECT *
                    FROM fb_na_energy na),
     energy_by_date AS (SELECT date, sum(consumption) AS total_energy
                        FROM total_energy
                        GROUP BY date
                        ORDER BY date ASC),
     max_energy AS (SELECT max(total_energy) AS max_energy
                    FROM energy_by_date)

SELECT  strftime('%Y-%m-%d', t1.date) date1,
        date(t1.date) date2,
        t1.date,
       t1.total_energy
FROM energy_by_date t1
JOIN max_energy t2 
ON t1.total_energy = t2.max_energy

[('2020-01-06', '2020-01-06', '2020-01-06 00:00:00', 1250),
 ('2020-01-07', '2020-01-07', '2020-01-07 00:00:00', 1250)]

In [7]:
%%sql
WITH total_energy AS (SELECT *
                    FROM fb_eu_energy eu
                    UNION ALL SELECT *
                    FROM fb_asia_energy asia
                    UNION ALL SELECT *
                    FROM fb_na_energy na),
        energy_rank AS (SELECT date,
                                sum(consumption) AS total_energy,
                                rank() OVER (ORDER BY sum(consumption) DESC) AS rnk
                        FROM total_energy
                        GROUP BY date
                        ORDER BY date ASC)
SELECT  date(date) date,
        total_energy
FROM energy_rank
WHERE rnk = 1;

[('2020-01-06', 1250), ('2020-01-07', 1250)]

## 4. Finding User Purchases
Write a query that'll identify returning active users. A returning active user is a user that has made a second purchase within 7 days of any other of their purchases. Output a list of user_ids of these returning active users.

In [8]:
%%sql
SELECT  t1.user_id,
        t1.created_at created_at_1st,
        t2.created_at created_at_2nd,
        JulianDay(t2.created_at) - JulianDay(t1.created_at) Diff_Days,
        (JulianDay(t2.created_at) - JulianDay(t1.created_at)) * 24 Diff_Hours,
        (JulianDay(t2.created_at) - JulianDay(t1.created_at)) * 24 * 60 Diff_Minutes,
        (JulianDay(t2.created_at) - JulianDay(t1.created_at)) * 24 * 60 * 60 Diff_Seconds
FROM amazon_transactions t1
JOIN amazon_transactions t2 
ON t1.user_id = t2.user_id and t1.created_at != t2.created_at and Diff_Days BETWEEN 0 AND 7
ORDER BY 1

[(100, '2020-03-13 00:00:00', '2020-03-18 00:00:00', 5.0, 120.0, 7200.0, 432000.0),
 (100, '2020-03-07 00:00:00', '2020-03-13 00:00:00', 6.0, 144.0, 8640.0, 518400.0),
 (103, '2020-03-29 00:00:00', '2020-03-31 00:00:00', 2.0, 48.0, 2880.0, 172800.0),
 (105, '2020-03-05 00:00:00', '2020-03-09 00:00:00', 4.0, 96.0, 5760.0, 345600.0),
 (109, '2020-03-02 00:00:00', '2020-03-03 00:00:00', 1.0, 24.0, 1440.0, 86400.0),
 (111, '2020-03-19 00:00:00', '2020-03-23 00:00:00', 4.0, 96.0, 5760.0, 345600.0),
 (111, '2020-03-18 00:00:00', '2020-03-19 00:00:00', 1.0, 24.0, 1440.0, 86400.0),
 (111, '2020-03-18 00:00:00', '2020-03-23 00:00:00', 5.0, 120.0, 7200.0, 432000.0),
 (112, '2020-03-23 00:00:00', '2020-03-24 00:00:00', 1.0, 24.0, 1440.0, 86400.0),
 (114, '2020-03-25 00:00:00', '2020-03-31 00:00:00', 6.0, 144.0, 8640.0, 518400.0),
 (117, '2020-03-19 00:00:00', '2020-03-22 00:00:00', 3.0, 72.0, 4320.0, 259200.0),
 (117, '2020-03-10 00:00:00', '2020-03-11 00:00:00', 1.0, 24.0, 1440.0, 86400.0),
 (120, '2020-03-18 00:00:00', '2020-03-21 00:00:00', 3.0, 72.0, 4320.0, 259200.0),
 (120, '2020-03-21 00:00:00', '2020-03-27 00:00:00', 6.0, 144.0, 8640.0, 518400.0),
 (122, '2020-03-06 00:00:00', '2020-03-07 00:00:00', 1.0, 24.0, 1440.0, 86400.0),
 (128, '2020-03-24 00:00:00', '2020-03-28 00:00:00', 4.0, 96.0, 5760.0, 345600.0),
 (130, '2020-03-12 00:00:00', '2020-03-16 00:00:00', 4.0, 96.0, 5760.0, 345600.0),
 (130, '2020-03-12 00:00:00', '2020-03-16 00:00:00', 4.0, 96.0, 5760.0, 345600.0),
 (130, '2020-03-09 00:00:00', '2020-03-12 00:00:00', 3.0, 72.0, 4320.0, 259200.0),
 (130, '2020-03-09 00:00:00', '2020-03-16 00:00:00', 7.0, 168.0, 10080.0, 604800.0),
 (130, '2020-03-09 00:00:00', '2020-03-16 00:00:00', 7.0, 168.0, 10080.0, 604800.0),
 (130, '2020-03-06 00:00:00', '2020-03-09 00:00:00', 3.0, 72.0, 4320.0, 259200.0),
 (130, '2020-03-06 00:00:00', '2020-03-12 00:00:00', 6.0, 144.0, 8640.0, 518400.0),
 (131, '2020-03-09 00:00:00', '2020-03-10 00:00:00', 1.0, 24.0, 1440.0, 86400.0),
 (133, '2020-03-21 00:00:00', '2020-03-26 00:00:00', 5.0, 120.0, 7200.0, 432000.0),
 (133, '2020-03-08 00:00:00', '2020-03-12 00:00:00', 4.0, 96.0, 5760.0, 345600.0),
 (141, '2020-03-17 00:00:00', '2020-03-21 00:00:00', 4.0, 96.0, 5760.0, 345600.0),
 (141, '2020-03-14 00:00:00', '2020-03-17 00:00:00', 3.0, 72.0, 4320.0, 259200.0),
 (141, '2020-03-14 00:00:00', '2020-03-21 00:00:00', 7.0, 168.0, 10080.0, 604800.0),
 (141, '2020-03-11 00:00:00', '2020-03-14 00:00:00', 3.0, 72.0, 4320.0, 259200.0),
 (141, '2020-03-11 00:00:00', '2020-03-17 00:00:00', 6.0, 144.0, 8640.0, 518400.0),
 (143, '2020-03-11 00:00:00', '2020-03-16 00:00:00', 5.0, 120.0, 7200.0, 432000.0),
 (150, '2020-03-20 00:00:00', '2020-03-21 00:00:00', 1.0, 24.0, 1440.0, 86400.0)]

In [9]:
%%sql
SELECT DISTINCT(t1.user_id)
FROM amazon_transactions t1
JOIN amazon_transactions t2 
ON t1.user_id = t2.user_id and t1.created_at != t2.created_at and JulianDay(t2.created_at) - JulianDay(t1.created_at) BETWEEN 0 AND 7
ORDER BY 1

[(100,),
 (103,),
 (105,),
 (109,),
 (111,),
 (112,),
 (114,),
 (117,),
 (120,),
 (122,),
 (128,),
 (130,),
 (131,),
 (133,),
 (141,),
 (143,),
 (150,)]

## 5. Popularity Percentage
Find the popularity percentage for each user on Facebook. The popularity percentage is defined as the total number of friends the user has divided by the total number of users on the platform, then converted into a percentage by multiplying by 100.
Output each user along with their popularity percentage. Order records in ascending order by user id.
The 'user1' and 'user2' column are pairs of friends.

In [10]:
%%sql
SELECT  user1,
        user2
FROM facebook_friends
UNION
SELECT  user2 AS user1,
        user1 AS user2
FROM facebook_friends

[(1, 2),
 (1, 3),
 (1, 4),
 (1, 5),
 (1, 6),
 (2, 1),
 (2, 6),
 (2, 7),
 (3, 1),
 (3, 8),
 (3, 9),
 (4, 1),
 (5, 1),
 (6, 1),
 (6, 2),
 (7, 2),
 (8, 3),
 (9, 3)]

In [11]:
%%sql
WITH table1 AS (SELECT  user1,
                        user2
                FROM facebook_friends
                UNION
                SELECT  user2 AS user1,
                        user1 AS user2
                FROM facebook_friends)
SELECT count(DISTINCT user1) AS users_count
FROM table1

[(9,)]

In [12]:
%%sql
WITH table1 AS (SELECT  user1,
                        user2
                FROM facebook_friends
                UNION
                SELECT  user2 AS user1,
                        user1 AS user2
                FROM facebook_friends),
    table2 AS (SELECT count(DISTINCT user1) AS users_count
                FROM table1)
SELECT t1.user1,
       ROUND(CAST(COUNT(*) AS float)*100/CAST(t2.users_count AS float),2) AS popularity_percentage
FROM    table1 t1,
        table2 t2
GROUP BY 1
ORDER BY 1

[(1, 55.56),
 (2, 33.33),
 (3, 33.33),
 (4, 11.11),
 (5, 11.11),
 (6, 22.22),
 (7, 11.11),
 (8, 11.11),
 (9, 11.11)]

In [13]:
%%sql
WITH table1 AS (SELECT  user1,
                        user2
                FROM facebook_friends
                UNION
                SELECT  user2 AS user1,
                        user1 AS user2
                FROM facebook_friends)
SELECT user1,
       ROUND(CAST(COUNT(*) AS float)*100/CAST(SUM(COUNT(DISTINCT user1)) OVER() AS float),2) AS popularity_percentage,
       SUM(COUNT(DISTINCT user1)) OVER() AS users_count
FROM table1
GROUP BY 1
ORDER BY 1

[(1, 55.56, 9),
 (2, 33.33, 9),
 (3, 33.33, 9),
 (4, 11.11, 9),
 (5, 11.11, 9),
 (6, 22.22, 9),
 (7, 11.11, 9),
 (8, 11.11, 9),
 (9, 11.11, 9)]

## 6. Highest Cost Orders
Find the customer with the highest daily total order cost between 2019-02-01 to 2019-05-01. If customer had more than one order on a certain day, sum the order costs on daily basis. Output their first name, total cost of their items, and the date.
 
 For simplicity, you can assume that every first name in the dataset is unique.

In [14]:
%%sql
WITH table1 AS (SELECT t1.first_name,
                        DATE(t2.order_date) order_date,
                        SUM(t2.total_order_cost) total_order_cost,
                        RANK() OVER(ORDER BY SUM(t2.total_order_cost) DESC) AS rnk
                FROM orders t2
                LEFT JOIN customers t1
                ON t1.id = t2.cust_id
                WHERE DATE(t2.order_date) BETWEEN '2019-02-01' AND '2019-05-01'
                GROUP BY 1,2)
SELECT first_name,
        total_order_cost,
        order_date
FROM table1
WHERE rnk = 1

[('Jill', 275, '2019-04-19')]

## 7. Users By Avg Session time
Calculate each user's average session time. A session is defined as the time difference between a page_load and page_exit. For simplicity, assume an user has only 1 session per day and if there are multiple of the same events in that day, consider only the latest page_load and earliest page_exit. Output the user_id and their average session time.

In [15]:
%%sql
SELECT *
FROM facebook_web_log

[(0, '2019-04-25 13:30:15', 'page_load'),
 (0, '2019-04-25 13:30:18', 'page_load'),
 (0, '2019-04-25 13:30:40', 'scroll_down'),
 (0, '2019-04-25 13:30:45', 'scroll_up'),
 (0, '2019-04-25 13:31:10', 'scroll_down'),
 (0, '2019-04-25 13:31:25', 'scroll_down'),
 (0, '2019-04-25 13:31:40', 'page_exit'),
 (1, '2019-04-25 13:40:00', 'page_load'),
 (1, '2019-04-25 13:40:10', 'scroll_down'),
 (1, '2019-04-25 13:40:15', 'scroll_down'),
 (1, '2019-04-25 13:40:20', 'scroll_down'),
 (1, '2019-04-25 13:40:25', 'scroll_down'),
 (1, '2019-04-25 13:40:30', 'scroll_down'),
 (1, '2019-04-25 13:40:35', 'page_exit'),
 (2, '2019-04-25 13:41:21', 'page_load'),
 (2, '2019-04-25 13:41:30', 'scroll_down'),
 (2, '2019-04-25 13:41:35', 'scroll_down'),
 (2, '2019-04-25 13:41:40', 'scroll_up'),
 (1, '2019-04-26 11:15:00', 'page_load'),
 (1, '2019-04-26 11:15:10', 'scroll_down'),
 (1, '2019-04-26 11:15:20', 'scroll_down'),
 (1, '2019-04-26 11:15:25', 'scroll_up'),
 (1, '2019-04-26 11:15:35', 'page_exit'),
 (0, '2019-04-28 14:30:15', 'page_load'),
 (0, '2019-04-28 14:30:10', 'page_load'),
 (0, '2019-04-28 13:30:40', 'scroll_down'),
 (0, '2019-04-28 15:31:40', 'page_exit')]

In [16]:
%%sql
WITH table1 AS (SELECT *
                FROM facebook_web_log
                where action = 'page_load'),
    table2 AS (SELECT *
                FROM facebook_web_log
                where action = 'page_exit')
SELECT t1.user_id,
        t1.timestamp,
        t2.timestamp,
        (JulianDay(t2.timestamp) - JulianDay(t1.timestamp)) * 24 * 60 * 60 AS session_duration
FROM table1 t1
JOIN table2 t2
ON t1.user_id = t2.user_id AND t2.timestamp > t1.timestamp
Group by 1,2

[(0, '2019-04-25 13:30:15', '2019-04-25 13:31:40', 84.99998152256012),
 (0, '2019-04-25 13:30:18', '2019-04-25 13:31:40', 81.99999779462814),
 (0, '2019-04-28 14:30:10', '2019-04-28 15:31:40', 3689.999981224537),
 (0, '2019-04-28 14:30:15', '2019-04-28 15:31:40', 3685.0000083446503),
 (1, '2019-04-25 13:40:00', '2019-04-25 13:40:35', 35.00001132488251),
 (1, '2019-04-26 11:15:00', '2019-04-26 11:15:35', 35.00001132488251)]

In [17]:
%%sql
SELECT user_id, 
        DATE(timestamp) AS date,
        MAX(timestamp) AS last_page_load
FROM facebook_web_log
WHERE action = 'page_load'
GROUP BY 1, 2

[(0, '2019-04-25', '2019-04-25 13:30:18'),
 (0, '2019-04-28', '2019-04-28 14:30:15'),
 (1, '2019-04-25', '2019-04-25 13:40:00'),
 (1, '2019-04-26', '2019-04-26 11:15:00'),
 (2, '2019-04-25', '2019-04-25 13:41:21')]

In [18]:
%%sql
WITH daily_start AS (SELECT user_id, 
                            DATE(timestamp) AS date,
                            MAX(timestamp) AS last_page_load
                    FROM facebook_web_log
                    WHERE action = 'page_load'
                    GROUP BY 1, 2), 
    daily_end AS (SELECT user_id, 
                        DATE(timestamp) AS date,
                        MIN(timestamp) AS first_page_exit
                    FROM facebook_web_log
                    WHERE action = 'page_exit'
                    GROUP BY 1,2)

SELECT t1.user_id, 
        AVG(JulianDay(t2.first_page_exit) - JulianDay(t1.last_page_load))*24*60*60 AS avg_session_time
FROM daily_start t1
JOIN daily_end t2
ON t1.user_id = t2.user_id AND t1.date = t2.date
GROUP BY 1

[(0, 1883.5000030696392), (1, 35.00001132488251)]

In [19]:
%%sql
with table1 AS (SELECT t1.user_id,
                        t1.timestamp,
                        (min(JulianDay(t2.timestamp)) - max(JulianDay(t1.timestamp)))*24*60*60 as session_duration
                FROM facebook_web_log t1
                JOIN facebook_web_log t2
                ON t1.user_id = t2.user_id
                WHERE t1.action = 'page_load' AND t2.action = 'page_exit' AND t2.timestamp > t1.timestamp
                GROUP BY 1, 2)
SELECT user_id,
        AVG(session_duration) AS _avg
FROM table1
GROUP BY 1

[(0, 1885.4999922215939), (1, 35.00001132488251)]

## 8. Monthly Percentage Difference
Given a table of purchases by date, calculate the month-over-month percentage change in revenue. The output should include the year-month date (YYYY-MM) and percentage change, rounded to the 2nd decimal point, and sorted from the beginning of the year to the end of the year.
The percentage change column will be populated from the 2nd month forward and can be calculated as ((this month's revenue - last month's revenue) / last month's revenue)*100.

In [20]:
%%sql
select * 
from sf_transactions
limit 10;

[(1, '2019-01-01 00:00:00', 172692, 43),
 (2, '2019-01-05 00:00:00', 177194, 36),
 (3, '2019-01-09 00:00:00', 109513, 30),
 (4, '2019-01-13 00:00:00', 164911, 30),
 (5, '2019-01-17 00:00:00', 198872, 39),
 (6, '2019-01-21 00:00:00', 184853, 31),
 (7, '2019-01-25 00:00:00', 186817, 26),
 (8, '2019-01-29 00:00:00', 137784, 22),
 (9, '2019-02-02 00:00:00', 140032, 25),
 (10, '2019-02-06 00:00:00', 116948, 43)]

In [21]:
%%sql
select strftime('%Y-%m',created_at) AS year_month,
        round(cast(sum(value) - lag(sum(value),1) over(order by strftime('%Y-%m',created_at) asc) as float)/cast(lag(sum(value),1) over(order by strftime('%Y-%m',created_at) asc) as float)*100,2) as revenue_diff_pct
from sf_transactions
group by 1
order by 1

[('2019-01', None),
 ('2019-02', -28.56),
 ('2019-03', 23.35),
 ('2019-04', -13.84),
 ('2019-05', 13.49),
 ('2019-06', -2.78),
 ('2019-07', -6.0),
 ('2019-08', 28.36),
 ('2019-09', -4.97),
 ('2019-10', -12.68),
 ('2019-11', 1.71),
 ('2019-12', -2.11)]

In [22]:
%%sql
with table1 AS (select strftime('%Y-%m',created_at) AS year_month,
                        sum(value) AS current_revenue,
                        lag(sum(value),1) over (order by strftime('%Y-%m',created_at) asc) as prev_revenue
                from sf_transactions
                group by 1
                order by 1)
select year_month,
       round(cast(current_revenue - prev_revenue as float)/cast(prev_revenue as float)*100,2) AS revenue_diff_pct
from table1

[('2019-01', None),
 ('2019-02', -28.56),
 ('2019-03', 23.35),
 ('2019-04', -13.84),
 ('2019-05', 13.49),
 ('2019-06', -2.78),
 ('2019-07', -6.0),
 ('2019-08', 28.36),
 ('2019-09', -4.97),
 ('2019-10', -12.68),
 ('2019-11', 1.71),
 ('2019-12', -2.11)]

## 9. Premium vs Freemium
Find the total number of downloads for paying and non-paying users by date. Include only records where non-paying customers have more downloads than paying customers. The output should be sorted by earliest date first and contain 3 columns date, non-paying downloads, paying downloads.

In [23]:
%%sql
select t1.user_id,
        t1.acc_id,
        DATE(t2.date) AS date,
        t2.downloads,
        t3.paying_customer
from ms_user_dimension t1
left join ms_download_facts t2
on t1.user_id = t2.user_id
left join ms_acc_dimension t3
on t3.acc_id = t1.acc_id

[(1, 716, '2020-08-24', 6, 'no'),
 (2, 749, '2020-08-22', 6, 'yes'),
 (3, 713, '2020-08-18', 2, 'no'),
 (4, 744, '2020-08-24', 4, 'yes'),
 (5, 726, '2020-08-19', 7, 'yes'),
 (6, 706, '2020-08-21', 3, 'no'),
 (7, 750, '2020-08-24', 1, 'yes'),
 (8, 732, '2020-08-24', 8, 'yes'),
 (9, 706, '2020-08-17', 5, 'no'),
 (10, 729, '2020-08-16', 4, 'yes'),
 (11, 748, '2020-08-22', 8, 'yes'),
 (12, 731, '2020-08-19', 6, 'yes'),
 (13, 739, '2020-08-15', 3, 'yes'),
 (14, 740, '2020-08-21', 0, 'yes'),
 (15, 705, '2020-08-24', 0, 'no'),
 (16, 706, '2020-08-15', 5, 'no'),
 (17, 701, '2020-08-18', 5, 'no'),
 (18, 746, '2020-08-23', 8, 'yes'),
 (19, 726, '2020-08-15', 6, 'yes'),
 (20, 748, '2020-08-25', 4, 'yes'),
 (21, 701, '2020-08-16', 1, 'no'),
 (22, 707, '2020-08-25', 4, 'no'),
 (23, 710, '2020-08-22', 7, 'no'),
 (24, 702, '2020-08-21', 4, 'no'),
 (25, 720, '2020-08-25', 5, 'no'),
 (26, 730, '2020-08-23', 6, 'yes'),
 (27, 721, '2020-08-19', 9, 'no'),
 (28, 733, '2020-08-24', 3, 'yes'),
 (29, 732, '2020-08-20', 0, 'yes'),
 (30, 729, '2020-08-25', 8, 'yes'),
 (31, 716, '2020-08-20', 5, 'no'),
 (32, 722, '2020-08-21', 8, 'no'),
 (33, 745, '2020-08-15', 6, 'yes'),
 (34, 737, '2020-08-24', 4, 'yes'),
 (35, 730, '2020-08-25', 1, 'yes'),
 (36, 729, '2020-08-24', 7, 'yes'),
 (37, 723, '2020-08-17', 8, 'no'),
 (38, 710, '2020-08-16', 8, 'no'),
 (39, 707, '2020-08-17', 1, 'no'),
 (40, 737, '2020-08-20', 8, 'yes'),
 (41, 717, '2020-08-18', 3, 'no'),
 (42, 741, '2020-08-16', 0, 'yes'),
 (43, 718, '2020-08-23', 9, 'no'),
 (44, 736, '2020-08-25', 9, 'yes'),
 (45, 720, '2020-08-16', 2, 'no'),
 (46, 743, '2020-08-15', 2, 'yes'),
 (47, 707, '2020-08-21', 1, 'no'),
 (48, 721, '2020-08-21', 4, 'no'),
 (49, 748, '2020-08-22', 8, 'yes'),
 (50, 715, '2020-08-17', 6, 'no'),
 (51, 709, '2020-08-21', 4, 'no'),
 (52, 732, '2020-08-20', 7, 'yes'),
 (53, 732, '2020-08-16', 7, 'yes'),
 (54, 712, '2020-08-20', 6, 'no'),
 (55, 701, '2020-08-20', 0, 'no'),
 (56, 721, '2020-08-21', 8, 'no'),
 (57, 744, '2020-08-18', 5, 'yes'),
 (58, 724, '2020-08-17', 2, 'no'),
 (59, 727, '2020-08-24', 3, 'yes'),
 (60, 743, '2020-08-20', 7, 'yes'),
 (61, 744, '2020-08-22', 8, 'yes'),
 (62, 717, '2020-08-15', 6, 'no'),
 (63, 723, '2020-08-23', 3, 'no'),
 (64, 713, '2020-08-17', 4, 'no'),
 (65, 706, '2020-08-16', 4, 'no'),
 (66, 731, '2020-08-16', 3, 'yes'),
 (67, 722, '2020-08-19', 1, 'no'),
 (68, 744, '2020-08-18', 2, 'yes'),
 (69, 705, '2020-08-17', 4, 'no'),
 (70, 703, '2020-08-22', 7, 'no'),
 (71, 725, '2020-08-20', 6, 'yes'),
 (72, 740, '2020-08-15', 2, 'yes'),
 (73, 713, '2020-08-17', 7, 'no'),
 (74, 732, '2020-08-22', 1, 'yes'),
 (75, 720, '2020-08-17', 8, 'no'),
 (76, 709, '2020-08-19', 0, 'no'),
 (77, 739, '2020-08-25', 1, 'yes'),
 (78, 703, '2020-08-25', 0, 'no'),
 (79, 732, '2020-08-17', 8, 'yes'),
 (80, 728, '2020-08-23', 7, 'yes'),
 (81, 737, '2020-08-24', 2, 'yes'),
 (82, 711, '2020-08-21', 0, 'no'),
 (83, 745, '2020-08-24', 4, 'yes'),
 (84, 734, '2020-08-21', 0, 'yes'),
 (85, 723, '2020-08-25', 7, 'no'),
 (86, 718, '2020-08-22', 1, 'no'),
 (87, 702, '2020-08-20', 2, 'no'),
 (88, 718, '2020-08-19', 3, 'no'),
 (89, 744, '2020-08-22', 8, 'yes'),
 (90, 710, '2020-08-24', 0, 'no'),
 (91, 727, '2020-08-22', 9, 'yes'),
 (92, 739, '2020-08-25', 7, 'yes'),
 (93, 728, '2020-08-25', 0, 'yes'),
 (94, 740, '2020-08-17', 1, 'yes'),
 (95, 744, '2020-08-23', 2, 'yes'),
 (96, 737, '2020-08-24', 3, 'yes'),
 (97, 726, '2020-08-21', 8, 'yes'),
 (98, 722, '2020-08-24', 0, 'no'),
 (99, 727, '2020-08-21', 9, 'yes'),
 (100, 712, '2020-08-25', 7, 'no')]

In [24]:
%%sql
select DATE(t2.date) AS date,
        sum(case when t3.paying_customer = 'no' then t2.downloads ELSE 0 end) as non_paying,
        sum(case when t3.paying_customer = 'yes' then t2.downloads ELSE 0 end) as paying
from ms_user_dimension t1
left join ms_download_facts t2
on t1.user_id = t2.user_id
left join ms_acc_dimension t3
on t3.acc_id = t1.acc_id
group by 1
HAVING non_paying > paying
order by 1

[('2020-08-16', 15, 14),
 ('2020-08-17', 45, 9),
 ('2020-08-18', 10, 7),
 ('2020-08-21', 32, 17)]

In [25]:
%%sql
with table1 AS (select DATE(t2.date) AS date,
                        sum(case when t3.paying_customer = 'no' then t2.downloads ELSE 0 end) as non_paying,
                        sum(case when t3.paying_customer = 'yes' then t2.downloads ELSE 0 end) as paying
                from ms_user_dimension t1
                left join ms_download_facts t2
                on t1.user_id = t2.user_id
                left join ms_acc_dimension t3
                on t3.acc_id = t1.acc_id
                group by 1
                order by 1)
select *
from table1
where non_paying > paying

[('2020-08-16', 15, 14),
 ('2020-08-17', 45, 9),
 ('2020-08-18', 10, 7),
 ('2020-08-21', 32, 17)]

## 10. Top 5 States With 5 Star Businesses
Find the top 5 states with the most 5 star businesses. Output the state name along with the number of 5-star businesses and order records by the number of 5-star businesses in descending order. In case there are ties in the number of businesses, return all the unique states. If two states have the same result, sort them in alphabetical order.

In [26]:
%%sql
SELECT * 
FROM yelp_business
LIMIT 3;

[('G5ERFWvPfHy7IDAUYlWL2A', 'All Colors Mobile Bumper Repair', None, '7137 N 28th Ave', 'Phoenix', 'AZ', '85051', 33.448, -112.074, 1.0, 4, 1, 'Auto Detailing;Automotive'),
 ('0jDvRJS-z9zdMgOUXgr6rA', 'Sunfare', None, '811 W Deer Valley Rd', 'Phoenix', 'AZ', '85027', 33.683, -112.085, 5.0, 27, 1, 'Personal Chefs;Food;Gluten-Free;Food Delivery Services;Event Planning & Services;Restaurants'),
 ('6HmDqeNNZtHMK0t2glF_gg', 'Dry Clean Vegas', 'Southeast', '2550 Windmill Ln, Ste 100', 'Las Vegas', 'NV', '89123', 36.042, -115.118, 1.0, 4, 1, 'Dry Cleaning & Laundry;Laundry Services;Local Services;Dry Cleaning')]

In [27]:
%%sql
WITH table1 AS (SELECT state,
                        SUM(CASE WHEN stars = 5 THEN 1 ELSE 0 END) AS n_businesses,
                        RANK() OVER (ORDER BY SUM(CASE WHEN stars = 5 THEN 1 ELSE 0 END) DESC) AS rnk
                FROM yelp_business
                GROUP BY 1)

SELECT state,
        n_businesses,
        rnk
FROM table1
WHERE rnk <= 5
ORDER BY 2 DESC,
        1 ASC;

[('AZ', 10, 1),
 ('ON', 5, 2),
 ('NV', 4, 3),
 ('IL', 3, 4),
 ('OH', 3, 4),
 ('WI', 3, 4)]

In [28]:
%%sql
WITH table1 AS (SELECT state,
                    count(business_id) AS n_businesses
            FROM yelp_business
            WHERE stars = 5
            GROUP BY state),
      table2 AS (SELECT *,
                  rank() OVER (ORDER BY n_businesses DESC) AS rnk
                  FROM table1)
SELECT state,
       n_businesses
FROM table2
WHERE rnk <= 5
ORDER BY 2 DESC,
         1 ASC

[('AZ', 10), ('ON', 5), ('NV', 4), ('IL', 3), ('OH', 3), ('WI', 3)]

## 11. Finding Updated Records
We have a table with employees and their salaries, however, some of the records are old and contain outdated salary information. Find the current salary of each employee assuming that salaries increase each year. Output their id, first name, last name, department ID, and current salary. Order your list by employee ID in ascending order.

In [29]:
%%sql
SELECT id,
        first_name,	
        last_name,
        department_id,
        MAX(salary) current_salary
FROM ms_employee_salary
GROUP BY 1,2,3,4
ORDER BY 1 ASC

[(1, 'Todd', 'Wilson', 1006, 110000),
 (2, 'Justin', 'Simon', 1005, 130000),
 (3, 'Kelly', 'Rosario', 1002, 42689),
 (4, 'Patricia', 'Powell', 1004, 170000),
 (5, 'Sherry', 'Golden', 1002, 44101),
 (6, 'Natasha', 'Swanson', 1005, 90000),
 (7, 'Diane', 'Gordon', 1002, 74591),
 (8, 'Mercedes', 'Rodriguez', 1005, 61048),
 (9, 'Christy', 'Mitchell', 1001, 150000),
 (10, 'Sean', 'Crawford', 1006, 190000),
 (11, 'Kevin', 'Townsend', 1002, 166861),
 (12, 'Joshua', 'Johnson', 1004, 123082),
 (13, 'Julie', 'Sanchez', 1001, 210000),
 (14, 'John', 'Coleman', 1001, 152434),
 (15, 'Anthony', 'Valdez', 1001, 96898),
 (16, 'Briana', 'Rivas', 1005, 151668),
 (17, 'Jason', 'Burnett', 1006, 42525),
 (18, 'Jeffrey', 'Harris', 1002, 20000),
 (19, 'Michael', 'Ramsey', 1003, 63159),
 (20, 'Cody', 'Gonzalez', 1004, 112809),
 (21, 'Stephen', 'Berry', 1002, 123617),
 (22, 'Brittany', 'Scott', 1002, 162537),
 (23, 'Angela', 'Williams', 1004, 100875),
 (24, 'William', 'Flores', 1003, 142674),
 (25, 'Pamela', 'Matthews', 1005, 57944),
 (26, 'Allison', 'Johnson', 1001, 128782),
 (27, 'Anthony', 'Ball', 1003, 34386),
 (28, 'Alexis', 'Beck', 1005, 12260),
 (29, 'Jason', 'Olsen', 1006, 51937),
 (30, 'Stephen', 'Smith', 1001, 194791),
 (31, 'Kimberly', 'Brooks', 1003, 95327),
 (32, 'Eric', 'Zimmerman', 1006, 83093),
 (33, 'Peter', 'Holt', 1002, 69945),
 (34, 'Justin', 'Dunn', 1003, 67992),
 (35, 'John', 'Ball', 1004, 47795),
 (36, 'Jesus', 'Ward', 1005, 36078),
 (37, 'Philip', 'Gillespie', 1006, 36424),
 (38, 'Nicole', 'Lewis', 1001, 114079),
 (39, 'Linda', 'Clark', 1002, 186781),
 (40, 'Colleen', 'Carrillo', 1004, 147723),
 (41, 'John', 'George', 1001, 21642),
 (42, 'Traci', 'Williams', 1003, 180000),
 (43, 'Joseph', 'Rogers', 1005, 22800),
 (44, 'Trevor', 'Carter', 1001, 38670),
 (45, 'Kevin', 'Duncan', 1003, 45210),
 (46, 'Joshua', 'Ewing', 1003, 73088),
 (47, 'Kimberly', 'Dean', 1003, 71416),
 (48, 'Robert', 'Lynch', 1004, 117960),
 (49, 'Amber', 'Harding', 1002, 77764),
 (50, 'Victoria', 'Wilson', 1002, 176620),
 (51, 'Theresa', 'Everett', 1002, 31404),
 (52, 'Kara', 'Smith', 1004, 192838),
 (53, 'Teresa', 'Cohen', 1001, 98860),
 (54, 'Wesley', 'Tucker', 1005, 90221),
 (55, 'Michael', 'Morris', 1005, 106799),
 (56, 'Rachael', 'Williams', 1002, 103585),
 (57, 'Patricia', 'Harmon', 1005, 147417),
 (58, 'Edward', 'Sharp', 1005, 41077),
 (59, 'Kevin', 'Robinson', 1005, 100924),
 (60, 'Charles', 'Pearson', 1004, 173317),
 (61, 'Ryan', 'Brown', 1003, 120000),
 (62, 'Dale', 'Hayes', 1005, 97662),
 (63, 'Richard', 'Sanford', 1001, 136083),
 (64, 'Danielle', 'Williams', 1006, 120000),
 (65, 'Deborah', 'Martin', 1004, 67389),
 (66, 'Dustin', 'Bush', 1004, 47567),
 (67, 'Tyler', 'Green', 1002, 111085),
 (68, 'Antonio', 'Carpenter', 1002, 83684),
 (69, 'Ernest', 'Peterson', 1005, 115993),
 (70, 'Karen', 'Fernandez', 1003, 101238),
 (71, 'Kristine', 'Casey', 1003, 67651),
 (72, 'Christine', 'Frye', 1004, 137244),
 (73, 'William', 'Preston', 1003, 155225),
 (74, 'Richard', 'Cole', 1003, 180361),
 (75, 'Julia', 'Ramos', 1006, 105000)]

## 12. Marketing Campaign Success [Advanced]
You have a table of in-app purchases by user. Users that make their first in-app purchase are placed in a marketing campaign where they see call-to-actions for more in-app purchases. Find the number of users that made additional in-app purchases due to the success of the marketing campaign.

The marketing campaign doesn't start until one day after the initial in-app purchase so users that make multiple purchases on the same day do not count, nor do we count users that make only the same purchases over time.

In [30]:
%%sql
SELECT user_id, 
        min(Date(created_at)) over (Partition By user_id) as first_order,
        min(Date(created_at)) over(partition by user_id,product_id) as prod_first_order
FROM marketing_campaign

[(10, '2019-01-01', '2019-01-01'),
 (10, '2019-01-01', '2019-03-31'),
 (10, '2019-01-01', '2019-01-02'),
 (11, '2019-01-02', '2019-01-02'),
 (11, '2019-01-02', '2019-03-31'),
 (12, '2019-01-02', '2019-03-31'),
 (12, '2019-01-02', '2019-01-02'),
 (13, '2019-01-05', '2019-01-05'),
 (13, '2019-01-05', '2019-03-31'),
 (14, '2019-01-06', '2019-01-06'),
 (14, '2019-01-06', '2019-01-06'),
 (14, '2019-01-06', '2019-03-31'),
 (15, '2019-01-08', '2019-01-08'),
 (15, '2019-01-08', '2019-01-09'),
 (15, '2019-01-08', '2019-03-31'),
 (16, '2019-01-10', '2019-03-31'),
 (16, '2019-01-10', '2019-01-10'),
 (17, '2019-01-11', '2019-03-31'),
 (17, '2019-01-11', '2019-01-11'),
 (18, '2019-01-12', '2019-01-12'),
 (18, '2019-01-12', '2019-01-12'),
 (19, '2019-01-12', '2019-01-12'),
 (20, '2019-01-15', '2019-01-15'),
 (21, '2019-01-16', '2019-01-16'),
 (21, '2019-01-16', '2019-01-17'),
 (22, '2019-01-18', '2019-01-18'),
 (22, '2019-01-18', '2019-01-19'),
 (23, '2019-01-20', '2019-01-20'),
 (24, '2019-01-21', '2019-01-21'),
 (25, '2019-01-22', '2019-01-22'),
 (25, '2019-01-22', '2019-01-22'),
 (25, '2019-01-22', '2019-01-22'),
 (25, '2019-01-22', '2019-01-22'),
 (26, '2019-01-25', '2019-01-25'),
 (27, '2019-01-26', '2019-01-26'),
 (28, '2019-01-27', '2019-01-27'),
 (29, '2019-01-27', '2019-01-27'),
 (30, '2019-01-29', '2019-01-29'),
 (31, '2019-01-30', '2019-01-30'),
 (32, '2019-01-31', '2019-01-31'),
 (33, '2019-01-31', '2019-01-31'),
 (34, '2019-01-31', '2019-01-31'),
 (35, '2019-02-03', '2019-02-03'),
 (36, '2019-02-04', '2019-02-04'),
 (37, '2019-02-05', '2019-02-05'),
 (38, '2019-02-06', '2019-02-06'),
 (39, '2019-02-07', '2019-02-07'),
 (40, '2019-02-08', '2019-02-08'),
 (41, '2019-02-08', '2019-02-08'),
 (42, '2019-02-10', '2019-02-10'),
 (43, '2019-02-11', '2019-02-11'),
 (43, '2019-02-11', '2019-03-05'),
 (44, '2019-02-12', '2019-03-05'),
 (44, '2019-02-12', '2019-02-12'),
 (45, '2019-02-13', '2019-03-05'),
 (45, '2019-02-13', '2019-02-13'),
 (46, '2019-02-14', '2019-02-14'),
 (46, '2019-02-14', '2019-02-14'),
 (46, '2019-02-14', '2019-02-14'),
 (46, '2019-02-14', '2019-03-10'),
 (46, '2019-02-14', '2019-03-10'),
 (47, '2019-02-14', '2019-03-11'),
 (47, '2019-02-14', '2019-02-14'),
 (48, '2019-02-14', '2019-03-12'),
 (48, '2019-02-14', '2019-02-14'),
 (49, '2019-02-18', '2019-02-18'),
 (49, '2019-02-18', '2019-02-18'),
 (49, '2019-02-18', '2019-02-18'),
 (49, '2019-02-18', '2019-02-18'),
 (50, '2019-02-20', '2019-02-20'),
 (50, '2019-02-20', '2019-02-20'),
 (50, '2019-02-20', '2019-02-20'),
 (50, '2019-02-20', '2019-02-20'),
 (51, '2019-02-21', '2019-03-13'),
 (51, '2019-02-21', '2019-02-21'),
 (52, '2019-02-23', '2019-03-18'),
 (52, '2019-02-23', '2019-02-23'),
 (53, '2019-02-24', '2019-03-19'),
 (53, '2019-02-24', '2019-02-24'),
 (54, '2019-02-25', '2019-03-20'),
 (54, '2019-02-25', '2019-02-25'),
 (55, '2019-02-26', '2019-02-26'),
 (55, '2019-02-26', '2019-02-26'),
 (56, '2019-02-27', '2019-02-27'),
 (56, '2019-02-27', '2019-03-20'),
 (57, '2019-02-28', '2019-03-20'),
 (57, '2019-02-28', '2019-02-28'),
 (57, '2019-02-28', '2019-02-28'),
 (57, '2019-02-28', '2019-03-20'),
 (58, '2019-02-28', '2019-03-01'),
 (58, '2019-02-28', '2019-03-25'),
 (58, '2019-02-28', '2019-02-28'),
 (58, '2019-02-28', '2019-03-02'),
 (59, '2019-03-04', '2019-03-04'),
 (60, '2019-03-05', '2019-03-05'),
 (61, '2019-03-26', '2019-03-26'),
 (62, '2019-03-27', '2019-03-27'),
 (63, '2019-03-27', '2019-03-27'),
 (64, '2019-03-27', '2019-03-27'),
 (65, '2019-03-27', '2019-03-27'),
 (66, '2019-03-31', '2019-03-31'),
 (67, '2019-03-31', '2019-03-31')]

In [31]:
%%sql 
WITH table1 AS (SELECT user_id, 
                        min(Date(created_at)) over (Partition By user_id) as first_order,
                        min(Date(created_at)) over(partition by user_id,product_id) as prod_first_order
                FROM marketing_campaign)

select count(distinct user_id) count
from table1
where first_order != prod_first_order

[(23,)]

## 13. Number Of Bathrooms And Bedrooms
Find the average number of bathrooms and bedrooms for each cityâ€™s property types. Output the result along with the city name and the property type.

In [32]:
%%sql
select city,
        property_type,
        round(avg(bathrooms),2) n_bathrooms_avg,
        round(avg(bedrooms),2) n_bedrooms_avg
from airbnb_search_details
group by 1,2
order by 1,2

[('Boston', 'Apartment', 1.0, 1.0),
 ('Boston', 'Condominium', 2.0, 2.0),
 ('Boston', 'House', 1.0, 1.0),
 ('Chicago', 'Apartment', 2.0, 2.0),
 ('Chicago', 'Condominium', 2.0, 2.0),
 ('Chicago', 'House', 2.0, 3.0),
 ('DC', 'House', 1.0, 1.0),
 ('LA', 'Apartment', 1.14, 1.14),
 ('LA', 'Bungalow', 1.0, 0.0),
 ('LA', 'Cabin', 3.0, 1.0),
 ('LA', 'Condominium', 1.5, 1.5),
 ('LA', 'House', 1.5, 1.56),
 ('LA', 'Loft', 1.0, 0.0),
 ('LA', 'Other', 1.0, 1.0),
 ('LA', 'Townhouse', 2.0, 3.0),
 ('LA', 'Villa', 2.07, 2.53),
 ('NYC', 'Apartment', 1.12, 1.25),
 ('NYC', 'Condominium', 1.0, 1.33),
 ('NYC', 'House', 1.4, 1.8),
 ('NYC', 'Loft', 1.0, 0.5),
 ('NYC', 'Townhouse', 1.0, 0.0),
 ('SF', 'Apartment', 1.0, 2.0),
 ('SF', 'House', 1.4, 1.8)]

## 14. Customer Details
Find the details of each customer regardless of whether the customer made an order. Output the customer's first name, last name, and the city along with the order details.
You may have duplicate rows in your results due to a customer ordering several of the same items. Sort records based on the customer's first name and the order details in ascending order.
Tables: customers, orders

In [33]:
%%sql
select first_name,
	    last_name,
        city,	
        order_details
from customers t1
left join orders t2
on t1.id = t2.cust_id
order by 1,4 asc

[('Emma', 'Isaac', 'Miami', None),
 ('Eva', 'Lucas', 'Arizona', 'Coat'),
 ('Eva', 'Lucas', 'Arizona', 'Shirts'),
 ('Eva', 'Lucas', 'Arizona', 'Slipper'),
 ('Farida', 'Joseph', 'San Francisco', 'Coat'),
 ('Farida', 'Joseph', 'San Francisco', 'Shirts'),
 ('Farida', 'Joseph', 'San Francisco', 'Shoes'),
 ('Farida', 'Joseph', 'San Francisco', 'Skirt'),
 ('Frank', 'Jacob', 'Miami', None),
 ('Henry', 'Jackson', 'Miami', 'Shoes'),
 ('Jack', 'Aiden', 'Arizona', None),
 ('Jill', 'Michael', 'Austin', 'Coat'),
 ('Jill', 'Michael', 'Austin', 'Coat'),
 ('Jill', 'Michael', 'Austin', 'Coat'),
 ('Jill', 'Michael', 'Austin', 'Dresses'),
 ('Jill', 'Michael', 'Austin', 'Shoes'),
 ('Jill', 'Michael', 'Austin', 'Skirt'),
 ('Jill', 'Michael', 'Austin', 'Suit'),
 ('Jill', 'Michael', 'Austin', 'Suit'),
 ('John', 'Joseph', 'San Francisco', None),
 ('Justin', 'Alexander', 'Denver', None),
 ('Liam', 'Samuel', 'Miami', None),
 ('Lili', 'Oliver', 'Los Angeles', None),
 ('Mark', 'Thomas', 'Arizona', None),
 ('Mia', 'Owen', 'Miami', 'Boats'),
 ('Mia', 'Owen', 'Miami', 'Dresses'),
 ('Mia', 'Owen', 'Miami', 'Jeans'),
 ('Mia', 'Owen', 'Miami', 'Shirts'),
 ('Mia', 'Owen', 'Miami', 'Shirts'),
 ('Mia', 'Owen', 'Miami', 'Skirt'),
 ('Mia', 'Owen', 'Miami', 'Slipper'),
 ('Mona', 'Adrian', 'Los Angeles', None),
 ('William', 'Daniel', 'Denver', 'Shirts'),
 ('William', 'Daniel', 'Denver', 'Shoes')]

## 15. Customer Revenue In March
Calculate the total revenue from each customer in March 2019. 

Output the revenue along with the customer id and sort the results based on the revenue in descending order.

In [34]:
%%sql
SELECT cust_id,
        SUM(case when strftime('%Y-%m',order_date) = '2019-03' then total_order_cost else 0 end) revenue
FROM orders
GROUP BY 1
HAVING revenue > 0
ORDER BY 2 DESC

[(3, 210), (15, 150), (7, 80), (12, 20)]

In [35]:
%%sql
SELECT cust_id,
        SUM(total_order_cost) revenue
FROM orders
WHERE strftime('%Y-%m',order_date) = '2019-03'
GROUP BY 1
ORDER BY 2 DESC

[(3, 210), (15, 150), (7, 80), (12, 20)]

In [36]:
%%sql
SELECT cust_id, 
        SUM(total_order_cost) as revenue
FROM orders
WHERE order_date BETWEEN '2019-03-01' AND '2019-03-31'
GROUP BY 1
ORDER BY 2 DESC

[(3, 210), (15, 150), (7, 80), (12, 20)]

## 16. Host Popularity Rental Prices
Youâ€™re given a table of rental property searches by users. The table consists of search results and outputs host information for searchers. Find the minimum, average, maximum rental prices for each hostâ€™s popularity rating. The hostâ€™s popularity rating is defined as below:
    0 reviews: New
    1 to 5 reviews: Rising
    6 to 15 reviews: Trending Up
    16 to 40 reviews: Popular
    more than 40 reviews: Hot

Tip: The `id` column in the table refers to the search ID. You'll need to create your own host_id by concating price, room_type, host_since, zipcode, and number_of_reviews.

Output host popularity rating and their minimum, average and maximum rental prices.

In [37]:
%%sql
with table1 AS (select price || room_type || DATE(host_since) || zipcode || number_of_reviews AS host_id,
                        price,
                        CASE WHEN number_of_reviews = 0 then 'New'
                        WHEN number_of_reviews BETWEEN 1 AND 5 THEN 'Rising'
                        WHEN number_of_reviews BETWEEN 6 AND 15 THEN 'Trending Up'
                        WHEN number_of_reviews BETWEEN 16 AND 40 THEN 'Popular'
                        WHEN number_of_reviews > 40 THEN 'Hot' END AS host_pop_rating
                from airbnb_search_details)

select host_pop_rating,
        min(price) min_price,
        round(avg(price),2) avg_price,
        max(price) max_price
from table1
group by 1
order by 1

[('Hot', 340.12, 464.23, 633.51),
 ('New', 313.55, 515.92, 741.76),
 ('Popular', 270.81, 472.82, 667.83),
 ('Rising', 355.53, 503.85, 717.01),
 ('Trending Up', 361.09, 476.28, 685.65)]

## 17. Popularity of Hack
Facebook has developed a new programing language called Hack.To measure the popularity of Hack they ran a survey with their employees. The survey included data on previous programing familiarity as well as the number of years of experience, age, gender and most importantly satisfaction with Hack. Due to an error location data was not collected, but your supervisor demands a report showing average popularity of Hack by office location. Luckily the user IDs of employees completing the surveys were stored.
Based on the above, find the average popularity of the Hack per office location.
Output the location along with the average popularity.

In [38]:
%%sql
select location,
    round(avg(popularity),2) avg_popularity
from facebook_employees t1
left join facebook_hack_survey t2
ON t1.id = t2.employee_id
GROUP BY 1
ORDER BY 2 DESC

[('India', 7.5), ('USA', 4.6), ('UK', 4.33), ('Switzerland', 1.0)]

## 18. Average Salaries
Compare each employee's salary with the average salary of the corresponding department.
Output the department, first name, and salary of employees along with the average salary of that department.

In [39]:
%%sql
SELECT department,
        first_name,
        salary,
        ROUND(AVG(salary) OVER(PARTITION BY department)) avg_
FROM employee;

[('Audit', 'Shandler', 1100, 950.0),
 ('Audit', 'Jason', 1000, 950.0),
 ('Audit', 'Celine', 1000, 950.0),
 ('Audit', 'Michale', 700, 950.0),
 ('Management', 'Katty', 150000, 175000.0),
 ('Management', 'Richerd', 250000, 175000.0),
 ('Management', 'George', 100000, 175000.0),
 ('Management', 'Allen', 200000, 175000.0),
 ('Sales', 'Max', 1300, 1336.0),
 ('Sales', 'Jennifer', 1000, 1336.0),
 ('Sales', 'Laila', 1000, 1336.0),
 ('Sales', 'Sarrah', 2000, 1336.0),
 ('Sales', 'Suzan', 1300, 1336.0),
 ('Sales', 'Mandy', 1300, 1336.0),
 ('Sales', 'Britney', 1200, 1336.0),
 ('Sales', 'Jack', 1300, 1336.0),
 ('Sales', 'Ben', 1300, 1336.0),
 ('Sales', 'Tom', 1200, 1336.0),
 ('Sales', 'Antoney', 1300, 1336.0),
 ('Sales', 'Morgan', 1200, 1336.0),
 ('Sales', 'Molly', 1400, 1336.0),
 ('Sales', 'Nicky', 1400, 1336.0),
 ('Sales', 'Monika', 1000, 1336.0),
 ('Sales', 'Mick', 2200, 1336.0),
 ('Sales', 'Adam', 1300, 1336.0),
 ('Sales', 'Mark', 1200, 1336.0),
 ('Sales', 'John', 1500, 1336.0),
 ('Sales', 'Joe', 1000, 1336.0),
 ('Sales', 'Henry', 2000, 1336.0),
 ('Sales', 'Sam', 1000, 1336.0)]

## 19. Classify Business Type
Classify each business as either a restaurant, cafe, school, or other. A restaurant should have the word 'restaurant' in the business name. For cafes, either 'cafe', 'cafÃ©', or 'coffee' can be in the business name. 'School' should be in the business name for schools. All other businesses should be classified as 'other'. Output the business name and the calculated classification.

In [40]:
%%sql
select distinct business_name,
        CASE WHEN LOWER(business_name) LIKE '%school%' THEN 'School'
            WHEN LOWER(business_name) LIKE '%cafe%' OR LOWER(business_name) LIKE '%cafÃ©%' OR LOWER(business_name) LIKE '%coffee%' THEN 'Cafe'
            WHEN LOWER(business_name) LIKE '%restaurant%' THEN 'Restaurant' 
            ELSE 'Other' END AS business_type
from sf_restaurant_health_violations

[('John Chin Elementary School', 'School'),
 ('Sutter Pub and Restaurant', 'Restaurant'),
 ('SRI THAI CUISINE', 'Other'),
 ('Washington Bakery & Restaurant', 'Restaurant'),
 ('Brothers Restaurant', 'Restaurant'),
 ('T & L FOOD MARKET', 'Other'),
 ('Antonelli Brothers Meat, Fish, and Poultry Inc.', 'Other'),
 ('STARBUCKS COFFEE CO. #603', 'Cafe'),
 ('Jiang Ling Cuisine Restaurant', 'Restaurant'),
 ('Wing Lee BBQ Restaurant', 'Restaurant'),
 ('Tenderloin Market & Deli', 'Other'),
 ('Big Fish Little Fish Poke', 'Other'),
 ('Laguna CafÃ©', 'Cafe'),
 ('The Castro Republic', 'Other'),
 ('SAFEWAY STORE #964', 'Other'),
 ('Home Plate', 'Other'),
 ('Cafe Bakery', 'Cafe'),
 ('MARTIN L. KING MIDDLE SCHOOL', 'School'),
 ('ROYAL GROUND COFFEE', 'Cafe'),
 ('Rico Pan', 'Other'),
 ('Dolores Park Outpost', 'Other'),
 ('SO', 'Other'),
 ('Crepe Cafe', 'Cafe'),
 ('L & G Vietnamese Sandwich', 'Other'),
 ('Allstars Cafe Inc', 'Cafe'),
 ('Tacolicious', 'Other'),
 ("Peet's Coffee & Tea", 'Cafe'),
 ('Veraci Pizza', 'Other'),
 ('Sharetea', 'Other'),
 ("Let's Be Frank", 'Other'),
 ('IL BORGO', 'Other'),
 ('Boss Supermarket', 'Other'),
 ('Dragoneats', 'Other'),
 ('MANIVANH THAI RESTAURANT', 'Restaurant'),
 ('Extreme Pizza', 'Other'),
 ('Nabe', 'Other'),
 ("NEW EMMY'S RESTAURANT", 'Restaurant'),
 ('Straw', 'Other'),
 ('General Nutrition #302', 'Other'),
 ('Dragon Beaux', 'Other'),
 ('SAKANA BUNE RESTAURANT', 'Restaurant'),
 ('Maggie Cafe', 'Cafe'),
 ('Live Oak School', 'School'),
 ('Southern Comfort Kitchen', 'Other'),
 ('Castro Street Chevron', 'Other'),
 ('Golden Wok', 'Other'),
 ('Expressions Snack Bar', 'Other'),
 ('In-N-Out Burger', 'Other'),
 ('Pho Express', 'Other'),
 ('China Fun Express', 'Other'),
 ('Taqueria Dos Charros', 'Other'),
 ('Cafe Broadway', 'Cafe'),
 ("YUMMA'S MED GRILL", 'Other'),
 ('Boos Voni', 'Other'),
 ('Duboce Park Cafe', 'Cafe'),
 ('West Coast Wine & Cheese', 'Other'),
 ('Starbucks Coffee', 'Cafe'),
 ('SUBWAY #31419', 'Other'),
 ('Carbon Grill', 'Other'),
 ('The Bindery', 'Other'),
 ('Subway 30303', 'Other'),
 ('TAQUERIA EL BUEN SABOR', 'Other'),
 ('Clay Oven Indian Cuisine', 'Other'),
 ('San Francisco Marriott Union Square - Main Kitchen', 'Other'),
 ('Chinatown Restaurant', 'Restaurant'),
 ('Hong Kong Clay Pot City Restaurant', 'Restaurant'),
 ('Great Eastern Restaurant', 'Restaurant'),
 ('HAMANO SUSHI', 'Other'),
 ("PASITA'S BAKERY", 'Other'),
 ('Golden Kim Tar Restaurant', 'Restaurant'),
 ('MV Taurus', 'Other'),
 ('Tacos San Buena', 'Other'),
 ('City Super', 'Other'),
 ('Souvla', 'Other'),
 ('Samiramis Imports', 'Other'),
 ('MARTHA & BROS. COFFEE CO', 'Cafe'),
 ('Cafe Bean', 'Cafe'),
 ('The Grove - Design District', 'Other'),
 ('LA VICTORIA BAKERY', 'Other'),
 ('Francisco Middle School', 'School'),
 ("Jay's Cheesesteak", 'Other'),
 ('King of Thai Noodles Cafe', 'Cafe'),
 ('Tanuki Restaurant', 'Restaurant'),
 ('Andersen Bakery', 'Other'),
 ('IRVING PIZZA', 'Other'),
 ('Contrada', 'Other'),
 ('Bellissimo Pizza', 'Other'),
 ("JIM'S RESTAURANT", 'Restaurant'),
 ('ABSINTHE PASTRY', 'Other'),
 ('Howard & 6th Street Food Market Inc.', 'Other'),
 ('PEKING WOK RESTAURANT', 'Restaurant'),
 ('The Good Life Grocery', 'Other'),
 ('Bursa', 'Other'),
 ('Hot Pot Island', 'Other'),
 ('New Luen Sing Fish Market', 'Other'),
 ('95117 Premium Commissary Room', 'Other'),
 ('Koja Kitchen CA01', 'Other'),
 ('Soo Fong Restaurant', 'Restaurant'),
 ('Split Bread', 'Other'),
 ('Coffee Cultures SOMA', 'Cafe'),
 ('Glaze Teriyaki', 'Other'),
 ('Seal Rock Inn Restaurant', 'Restaurant'),
 ('Keep It, Inc.', 'Other'),
 ('Yummy Sticks', 'Other'),
 ('Red Jade Restaurant', 'Restaurant'),
 ('EL POLLO SUPREMO', 'Other'),
 ('Kuma Sushi + Sake', 'Other'),
 ('Escape From New York Pizza', 'Other'),
 ('Wines of California Wine Bar', 'Other'),
 ('T & L Liquor Store Inc.', 'Other'),
 ('Events Management @ Legion of Honor', 'Other'),
 ('Buckhorn Grill', 'Other'),
 ('La Quinta Restaurant', 'Restaurant'),
 ('Elephant Sushi', 'Other'),
 ("SENIORE'S PIZZA", 'Other'),
 ('Hook a Cook', 'Other'),
 ('Bayshore Taqueria', 'Other'),
 ('Man Sung Company', 'Other'),
 ('Rotee Express', 'Other'),
 ('STARBUCKS COFFEE', 'Cafe'),
 ("DONA TERE'S MARKET", 'Other'),
 ('Jersey', 'Other'),
 ("Cecilia's Pizza & Restaurant", 'Restaurant'),
 ('Crepe and Brioche, Inc.', 'Other'),
 ('Cabin', 'Other'),
 ('Mi Yucatan', 'Other'),
 ('Jane the Bakery', 'Other'),
 ('North Point Market', 'Other'),
 ('Wing Lum Cafe', 'Cafe'),
 ('MICADO RESTAURANT', 'Restaurant'),
 ("Ramzi's Cafe", 'Cafe'),
 ('Blue Bottle Coffee', 'Cafe'),
 ('Fresca Gardens, Inc', 'Other'),
 ('Cadillac Market', 'Other'),
 ('PRESIDIO THEATRE', 'Other'),
 ('Restaurante Montecristo', 'Restaurant'),
 ('AT&T - COMMISARY KITCHEN [145184]', 'Other'),
 ('Old Blue', 'Other'),
 ('Akira Japanese Restaurant', 'Restaurant'),
 ('Minna SF Group LLC', 'Other'),
 ('Subway #36339', 'Other'),
 ('Champa Garden', 'Other'),
 ('Starbucks', 'Other'),
 ('CALIFORNIA PACIFIC MEDICAL CENTER', 'Other'),
 ('Pectopah LLC', 'Other'),
 ('The Salvation Army', 'Other'),
 ('Harvest Urban Market', 'Other'),
 ("Roadside Rosy's", 'Other'),
 ('Tupelo', 'Other'),
 ('Del Popolo LLC', 'Other'),
 ('S & T Hong Kong Seafood', 'Other'),
 ("Annie's Hot Dogs & Pretzels", 'Other'),
 ('Bubble Cafe', 'Cafe'),
 ('Cafe Fiore', 'Cafe'),
 ('Rock Japanese Cuisine', 'Other'),
 ('LOS PANCHOS', 'Other'),
 ('Juice Craze', 'Other'),
 ('A La Turca', 'Other'),
 ('VIP Coffee & Cake Shop', 'Cafe'),
 ('S. F. Gourmet Hot Dog Cart', 'Other'),
 ('Pho Luen Fat Bakery & Restaurant', 'Restaurant'),
 ('Earthbar', 'Other'),
 ("Miller's East Coast Deli", 'Other'),
 ('Flores', 'Other'),
 ('Pho Huynh Sang', 'Other'),
 ('Little Vietnam Cafe', 'Cafe'),
 ('ITALIAN AMERICAN SOCIAL CLUB', 'Other'),
 ('Poke Kana', 'Other'),
 ('AT&T Park - Coffee and Ice Cream (5A+5B)', 'Cafe'),
 ("Rusty's Southern LLC", 'Other'),
 ('Belly Burger', 'Other'),
 ('Project Juice', 'Other'),
 ('Panuchos', 'Other'),
 ('Gateway High/Kip Schools', 'School'),
 ('Taco Bell Cantina #31685', 'Other'),
 ('House of Bagels', 'Other'),
 ('Batter Bakery', 'Other'),
 ('Toy Boat Dessert Cafe', 'Cafe'),
 ('Angel Cafe and Deli', 'Cafe'),
 ('Iza Ramen', 'Other'),
 ('STARBUCKS COFFEE CO', 'Cafe'),
 ('King of Thai Noodle House', 'Other'),
 ('Surisan', 'Other'),
 ('Starbucks Coffee Co', 'Cafe'),
 ('Urban Putt', 'Other'),
 ('Chowders', 'Other'),
 ('Bebebar Juice & Sandwich', 'Other'),
 ('The AA Bakery & Cafe', 'Cafe'),
 ('Cream', 'Other'),
 ('PIZZA HUT #758280', 'Other'),
 ('CHA-AM RESTAURANT', 'Restaurant'),
 ('Pica Pica', 'Other'),
 ('AK SUBS', 'Other'),
 ("Cathead's BBQ", 'Other'),
 ('Modern Thai Inc.', 'Other'),
 ('SH Dream Inc', 'Other'),
 ('Heritage', 'Other'),
 ('A Mano', 'Other'),
 ("Castagnola's Restaurant", 'Restaurant'),
 ('BALBOA HIGH SCHOOL', 'School'),
 ('Park Gyros Castro', 'Other'),
 ('SF BAGEL CO. (KATZ BAGELS)', 'Other'),
 ('New Regent Cafe', 'Cafe'),
 ('Thai Cottage Restaurant', 'Restaurant'),
 ("Luke's Local Inc.", 'Other'),
 ('Fair Trade Cafe LLC', 'Cafe'),
 ('GOLDEN PRODUCE', 'Other'),
 ("PANCHO'S", 'Other'),
 ('NORTH BEACH PIZZA', 'Other'),
 ('India Clay Oven Restaurant and Bar', 'Restaurant'),
 ('Pabu', 'Other'),
 ('Old Siam Thai Restaurant', 'Restaurant'),
 ('My Ivy Corp.', 'Other'),
 ('Salem Grocery', 'Other'),
 ('Sam Rong Cafe', 'Cafe'),
 ('Dim Sum Bistro', 'Other'),
 ('Ha Nam Ninh Restaurant', 'Restaurant'),
 ('TSING TAO RESTAURANT', 'Restaurant'),
 ('WING HING RESTAURANT', 'Restaurant'),
 ('Brendas Meat & Three', 'Other'),
 ('LA ALTENA', 'Other'),
 ('House of Xian Dumpling', 'Other'),
 ('BLOWFISH SUSHI', 'Other'),
 ('The Lord George', 'Other'),
 ('Westfield Food Court Scullery', 'Other'),
 ('JAVA ON OCEAN', 'Other'),
 ('Chez Julien', 'Other'),
 ('Rico Pan Bakery', 'Other'),
 ('CLEMENT BBQ RESTAURANT', 'Restaurant'),
 ('Burger King 4525', 'Other'),
 ('SEGAFREDO', 'Other'),
 ('Milkbomb Ice Cream', 'Other'),
 ('Morning Brew Cafe', 'Cafe'),
 ('Mixt Greens', 'Other'),
 ('MONGKOK DIM SUM & RESTAURANT', 'Restaurant'),
 ('Mizutani Sushi Bar', 'Other'),
 ('Yerba Buena Tea Co (formerly Tea Smiths of SF)', 'Other'),
 ("Azalina's", 'Other'),
 ('TropisueÃ±o', 'Other'),
 ('Golden Natural Foods', 'Other'),
 ('Hong Kee & Kim', 'Other'),
 ('7-Eleven, Store 2366-21389F', 'Other'),
 ('DENMAN MIDDLE SCHOOL', 'School'),
 ('Quickly', 'Other'),
 ('Jackson Fillmore Trattoria', 'Other'),
 ("J.B.'S PLACE", 'Other'),
 ('Prospect', 'Other'),
 ("TAWAN'S THAI FOOD", 'Other'),
 ('Stanford Court Hotel', 'Other'),
 ('Ninki Sushi Bar & Restaurant', 'Restaurant'),
 ("Kate O'Brien's", 'Other'),
 ("David's Deli & Bistro", 'Other'),
 ('Cafe Insalata', 'Cafe'),
 ('24th and Folsom Eatery', 'Other'),
 ('Hilton Financial District- Restaurant Seven Fifty', 'Restaurant'),
 ('24 Hour Fitness Club, #273', 'Other'),
 ('California Pizza Kitchen, Inc.', 'Other'),
 ('Dip, LLC', 'Other'),
 ('Marina Meats Inc.', 'Other'),
 ('The Willows', 'Other'),
 ('Tai Hing Inc.', 'Other'),
 ('Sushi Hon', 'Other'),
 ('Roma Pizzeria', 'Other'),
 ('Hans Coffee Shop', 'Cafe'),
 ('Pollo Campero', 'Other'),
 ('Lollipot', 'Other'),
 ('Da Cafe', 'Cafe'),
 ('Roxanne Cafe', 'Cafe')]

## 20. Top Cool Votes
Find the review_text that received the highest number of  'cool' votes.
Output the business name along with the review text with the highest numbef of 'cool' votes.

In [41]:
%%sql
with table1 AS (select review_text,
                        business_name,
                        rank() over (order by cool DESC) rnk
                from yelp_reviews)
SELECT business_name,
        review_text
FROM table1
WHERE rnk = 1

[('Roka Akor', 'I hate to admit it, but it had been a long while since my last visit to Roka Akor. I deserve a hand slap. But last week, I had the perfect excuse to p'),
 ('Lunardis', 'This is the nicest grocery store in the city. I actually met my wife at this grocery store while shopping for avocados.')]

In [42]:
%%sql
SELECT business_name,
        review_text
FROM yelp_reviews
WHERE cool = (select max(cool) from yelp_reviews)

[('Roka Akor', 'I hate to admit it, but it had been a long while since my last visit to Roka Akor. I deserve a hand slap. But last week, I had the perfect excuse to p'),
 ('Lunardis', 'This is the nicest grocery store in the city. I actually met my wife at this grocery store while shopping for avocados.')]

## 21. Order Details
Find order details made by Jill and Eva.
Consider the Jill and Eva as first names of customers.
Output the order date, details and cost along with the first name.
Order records based on the customer id in ascending order.

In [43]:
%%sql
SELECT first_name,
        DATE(order_date) order_date,
        order_details,
        total_order_cost
from customers t1
inner join orders t2
on t1.id = t2.cust_id
WHERE first_name IN ('Jill','Eva')

[('Jill', '2019-02-01', 'Coat', 25),
 ('Jill', '2019-03-10', 'Shoes', 80),
 ('Jill', '2019-04-01', 'Suit', 50),
 ('Jill', '2019-04-02', 'Skirt', 30),
 ('Jill', '2019-04-03', 'Dresses', 50),
 ('Jill', '2019-04-04', 'Coat', 25),
 ('Jill', '2019-04-19', 'Coat', 125),
 ('Jill', '2019-04-19', 'Suit', 150),
 ('Eva', '2019-01-11', 'Coat', 125),
 ('Eva', '2019-01-11', 'Shirts', 60),
 ('Eva', '2019-03-11', 'Slipper', 20)]

## 22. Reviews of Categories
Find the top business categories based on the total number of reviews. Output the category along with the total number of reviews. Order by total reviews in descending order.

In [44]:
%%sql
select review_count,
        categories
from yelp_business;

[(4, 'Auto Detailing;Automotive'),
 (27, 'Personal Chefs;Food;Gluten-Free;Food Delivery Services;Event Planning & Services;Restaurants'),
 (4, 'Dry Cleaning & Laundry;Laundry Services;Local Services;Dry Cleaning'),
 (3, 'Wedding Planning;Caterers;Event Planning & Services;Venues & Event Spaces'),
 (5, 'Notaries;Printing Services;Local Services;Shipping Centers'),
 (35, 'Home Services;Television Service Providers;Professional Services;Internet Service Providers;Utilities'),
 (3, 'Bars;Restaurants;Pubs;British;Nightlife'),
 (6, 'Hotels & Travel;Car Rental'),
 (13, 'Fast Food;Sandwiches;Restaurants'),
 (10, 'Rolfing;Health & Medical;Beauty & Spas;Massage'),
 (6, 'Financial Services;Banks & Credit Unions'),
 (57, 'Food;Ice Cream & Frozen Yogurt'),
 (7, 'Shopping;Home & Garden;Home Services;Cabinetry;Furniture Stores'),
 (56, 'Burgers;Bars;American (Traditional);Nightlife;Restaurants;Sports Bars;Steakhouses'),
 (20, 'Hair Removal;Beauty & Spas;Skin Care;Tanning;Spray Tanning;Hair Salons'),
 (16, 'Restaurants;Ice Cream & Frozen Yogurt;Fast Food;Food'),
 (3, 'Restaurants;Pizza'),
 (3, 'Hotels;Hotels & Travel;Event Planning & Services'),
 (8, 'Health & Medical;Physical Therapy'),
 (46, 'Restaurants;Seafood;Chinese;Dim Sum'),
 (5, 'Vape Shops;Shopping;Electronics;Tobacco Shops'),
 (3, 'Home Services;Windows Installation;Garage Door Services;Contractors'),
 (5, 'Bars;Restaurants;Nightlife;American (Traditional);Burgers'),
 (3, 'Bike Rentals;Motorcycle Dealers;Active Life;Shopping;Bikes;Sporting Goods;Automotive'),
 (28, 'Pet Training;Pet Stores;Pets;Pet Groomers;Pet Services;Pet Sitting'),
 (40, 'French;Restaurants'),
 (13, 'Dog Walkers;Pet Training;Pet Services;Pets;Pet Sitting'),
 (8, 'Health & Medical;Shopping;Eyewear & Opticians;Optometrists'),
 (4, 'Doctors;Orthopedists;Health & Medical;Sports Medicine'),
 (3, 'Ice Cream & Frozen Yogurt;Food'),
 (45, 'Breakfast & Brunch;Restaurants;American (New);American (Traditional)'),
 (40, 'Fast Food;Mexican;Restaurants'),
 (4, 'Health & Medical;Cosmetic Dentists;Dentists;General Dentistry'),
 (9, 'Car Rental;Hotels & Travel'),
 (52, 'Ophthalmologists;Health & Medical;Eyewear & Opticians;Shopping;Optometrists;Doctors'),
 (3, 'Interior Design;Home Services;Home & Garden;Shopping;Real Estate;Home Staging;Home Decor'),
 (8, 'Naturopathic/Holistic;Traditional Chinese Medicine;Doctors;Acupuncture;Health & Medical'),
 (29, 'Shopping;Thrift Stores;Fashion;Used;Vintage & Consignment'),
 (10, 'Arts & Entertainment;Local Services'),
 (19, 'Asian Fusion;Japanese;Restaurants;Salad'),
 (24, 'Hair Salons;Blow Dry/Out Services;Beauty & Spas;Cosmetics & Beauty Supply;Hair Extensions;Shopping'),
 (46, 'Sandwiches;Chicken Wings;Restaurants;Pizza'),
 (4, 'Fitness & Instruction;Active Life;Gyms;Trainers;Interval Training Gyms;Boot Camps'),
 (3, 'Home Decor;Shopping;Jewelry;Home & Garden'),
 (20, 'Restaurants;Asian Fusion;Halal;Chinese'),
 (5, 'Sandwiches;Fast Food;Restaurants'),
 (7, 'Medical Centers;Diagnostic Services;Health & Medical;Laboratory Testing'),
 (3, 'German;Bars;Nightlife;Wine Bars;Restaurants'),
 (21, 'Bars;Nightlife;Pubs'),
 (75, 'Greek;Restaurants;Pizza;Italian'),
 (12, 'Photographers;Event Photography;Session Photography;Event Planning & Services'),
 (17, 'Restaurants;Nightlife;Pizza;Cocktail Bars;Bars;Italian'),
 (18, 'Local Services;Sewing & Alterations;Laundry Services;Dry Cleaning & Laundry'),
 (7, 'Local Services;Pest Control'),
 (20, 'Kitchen & Bath;Shopping;Home & Garden;Restaurant Supplies;Professional Services;Wholesalers'),
 (3, 'Metal Fabricators;Heating & Air Conditioning/HVAC;Local Services;Home Services;Appliances & Repair'),
 (21, 'Italian;Restaurants;Pizza'),
 (17, 'Italian;Restaurants;Event Planning & Services;Caterers'),
 (25, 'Automotive;Car Dealers'),
 (20, 'Coffee & Tea;Food'),
 (3, 'Cafes;Food;Food Delivery Services;Sandwiches;Restaurants'),
 (18, 'Restaurants'),
 (10, 'Restaurants;Chinese'),
 (187, 'Pizza;Restaurants'),
 (3, 'Active Life;Pilates;Fitness & Instruction'),
 (16, 'Libraries;Public Services & Government'),
 (18, 'Restaurants;Asian Fusion;Sports Bars;Bars;Nightlife'),
 (8, 'Mexican;Restaurants'),
 (331, 'Restaurants;Chinese;Japanese;Sushi Bars'),
 (3, 'Heating & Air Conditioning/HVAC;Home Services'),
 (20, 'Delis;Coffee & Tea;Restaurants;Food'),
 (87, 'Desserts;Italian;Pizza;Event Planning & Services;Buffets;Sandwiches;Food;Venues & Event Spaces;Restaurants'),
 (6, 'Food;Food Trucks'),
 (43, 'Nail Salons;Beauty & Spas'),
 (4, 'Local Services;Furniture Repair;Watch Repair'),
 (5, 'Financial Services;Wine Bars;Restaurants;Italian;Pizza;Financial Advising;Caterers;Nightlife;Food;Wedding Planning;Event Planning & Services;Bars'),
 (3, 'German;Restaurants;Food Stands;Curry Sausage;Schnitzel'),
 (5, 'Arts & Entertainment;Festivals'),
 (27, 'Restaurants;Sandwiches;Breakfast & Brunch;Bagels;Food'),
 (4, 'Health & Medical;Dentists;Cosmetic Dentists;General Dentistry'),
 (77, 'Nightlife;Food;Specialty Food;Sports Bars;Bars'),
 (6, 'Health & Medical;Traditional Chinese Medicine'),
 (17, 'Massage;Medical Spas;Health & Medical;Chiropractors;Beauty & Spas;Physical Therapy;Acupuncture'),
 (6, 'Health & Medical;Walk-in Clinics;Medical Centers'),
 (120, 'Gluten-Free;Food;Canadian (New);Restaurants;Beer;Wine & Spirits;Vegan'),
 (19, 'Food;Caribbean;Specialty Food;Restaurants;Indian'),
 (101, 'Middle Eastern;Greek;Mediterranean;Lebanese;Restaurants'),
 (7, 'American (Traditional);Restaurants;Fish & Chips'),
 (197, 'American (New);Restaurants;Gluten-Free;Modern European'),
 (6, 'Guns & Ammo;Shopping;Gun/Rifle Ranges;Active Life'),
 (13, 'Water Stores;Ice Cream & Frozen Yogurt;Shaved Ice;Food'),
 (6, 'Cabinetry;Home Services;Contractors'),
 (5, 'Parks;Active Life'),
 (11, "Women's Clothing;Shopping;Swimwear;Lingerie;Fashion"),
 (8, 'Bakeries;Food'),
 (3, "Women's Clothing;Shopping;Fashion;Men's Clothing"),
 (10, 'Chinese;Barbeque;Restaurants'),
 (7, 'Pubs;American (Traditional);Nightlife;Bars;Pizza;Restaurants'),
 (8, 'Salad;Pizza;Restaurants;Event Planning & Services;Vietnamese;Caterers'),
 (5, 'Property Management;Condominiums;Apartments;Home Services;Real Estate')]

## 23. Highest Salary In Department
Find the employee with the highest salary per department.
Output the department name, employee's first name along with the corresponding salary.

In [45]:
%%sql
select department,
        first_name,
        salary,
        rank() over (partition by department order by salary desc) rnk
from employee

[('Audit', 'Shandler', 1100, 1),
 ('Audit', 'Jason', 1000, 2),
 ('Audit', 'Celine', 1000, 2),
 ('Audit', 'Michale', 700, 4),
 ('Management', 'Richerd', 250000, 1),
 ('Management', 'Allen', 200000, 2),
 ('Management', 'Katty', 150000, 3),
 ('Management', 'George', 100000, 4),
 ('Sales', 'Mick', 2200, 1),
 ('Sales', 'Sarrah', 2000, 2),
 ('Sales', 'Henry', 2000, 2),
 ('Sales', 'John', 1500, 4),
 ('Sales', 'Molly', 1400, 5),
 ('Sales', 'Nicky', 1400, 5),
 ('Sales', 'Max', 1300, 7),
 ('Sales', 'Suzan', 1300, 7),
 ('Sales', 'Mandy', 1300, 7),
 ('Sales', 'Jack', 1300, 7),
 ('Sales', 'Ben', 1300, 7),
 ('Sales', 'Antoney', 1300, 7),
 ('Sales', 'Adam', 1300, 7),
 ('Sales', 'Britney', 1200, 14),
 ('Sales', 'Tom', 1200, 14),
 ('Sales', 'Morgan', 1200, 14),
 ('Sales', 'Mark', 1200, 14),
 ('Sales', 'Jennifer', 1000, 18),
 ('Sales', 'Laila', 1000, 18),
 ('Sales', 'Monika', 1000, 18),
 ('Sales', 'Joe', 1000, 18),
 ('Sales', 'Sam', 1000, 18)]

In [46]:
%%sql
with table1 as (select department,
                        first_name,
                        salary,
                        rank() over (partition by department order by salary desc) rnk
                from employee)
SELECT department,
        first_name,
        salary
FROM table1
WHERE rnk = 1
ORDER BY 3 DESC

[('Management', 'Richerd', 250000),
 ('Sales', 'Mick', 2200),
 ('Audit', 'Shandler', 1100)]

In [47]:
%%sql
-- not efficient solution for same highest salary of more than one employee ber department 
select department,
        first_name,
        max(salary) salary
from employee
GROUP BY 1
ORDER BY 1,3 DESC

[('Audit', 'Shandler', 1100),
 ('Management', 'Richerd', 250000),
 ('Sales', 'Mick', 2200)]

In [48]:
%%sql
WITH table1 AS (SELECT department, 
                        MAX(salary) salary
                FROM employee         
                GROUP BY department)

SELECT  department,
        first_name,
        salary
FROM employee
WHERE (department,salary) IN table1

[('Management', 'Richerd', 250000),
 ('Sales', 'Mick', 2200),
 ('Audit', 'Shandler', 1100)]

## 24. Lowest Salary In Department
Find the employee with the Lowest salary per department.
Output the department name, employee's first name along with the corresponding salary.

In [49]:
%%sql
with table1 as (select department,
                        first_name,
                        salary,
                        rank() over (partition by department order by salary ASC) rnk
                from employee)
SELECT department,
        first_name,
        salary
FROM table1
WHERE rnk = 1
ORDER BY 1,3 DESC

[('Audit', 'Michale', 700),
 ('Management', 'George', 100000),
 ('Sales', 'Jennifer', 1000),
 ('Sales', 'Laila', 1000),
 ('Sales', 'Monika', 1000),
 ('Sales', 'Joe', 1000),
 ('Sales', 'Sam', 1000)]

In [50]:
%%sql
WITH table1 AS (SELECT department, 
                        MIN(salary) salary
                FROM employee         
                GROUP BY department)

SELECT  department,
        first_name,
        salary
FROM employee
WHERE (department,salary) IN table1
ORDER BY 1,3 DESC

[('Audit', 'Michale', 700),
 ('Management', 'George', 100000),
 ('Sales', 'Jennifer', 1000),
 ('Sales', 'Laila', 1000),
 ('Sales', 'Monika', 1000),
 ('Sales', 'Joe', 1000),
 ('Sales', 'Sam', 1000)]

## 25. Workers With The Highest Salaries
Find the titles of workers that earn the highest salary. Output the highest-paid title or multiple titles that share the highest salary.

In [51]:
%%sql
with table1 as (select worker_title,
                        salary,
                        rank() over (order by salary DESC) rnk
                from worker
                inner join title
                on worker.worker_id = title.worker_ref_id)
select worker_title AS best_paid_title
from table1
WHERE rnk = 1

[('Asst. Manager',), ('Manager',)]

In [52]:
%%sql
with table1 as (select MAX(salary)
                from worker)

select worker_title AS best_paid_title
from worker
inner join title
on worker.worker_id = title.worker_ref_id
WHERE salary IN table1

[('Asst. Manager',), ('Manager',)]

## 26. Employee and Manager Salaries
Find employees who are earning more than their managers. Output the employee name along with the corresponding salary.

In [53]:
%%sql
with table1 AS (select id AS manager_id,
                        first_name AS manager_name,
                        salary AS manager_salary
                from employee),
        table2 AS (select id,
                        first_name,
                        manager_id,
                        salary
                from employee)

SELECT first_name,
        salary
FROM table1 t1
INNER JOIN table2 t2
ON t1.manager_id = t2.manager_id
WHERE salary > manager_salary

[('Richerd', 250000)]

## 27. Number of violations
You're given a dataset of health inspections. Count the number of violation in an inspection in 'Roxanne Cafe' for each year. If an inspection resulted in a violation, there will be a value in the 'violation_id' column. Output the number of violations by year in ascending order.

In [54]:
%%sql
SELECT strftime('%Y',inspection_date) AS date,
        count(violation_id) AS n_inspections
FROM sf_restaurant_health_violations
WHERE business_name = 'Roxanne Cafe'
GROUP BY 1

[('2015', 5), ('2016', 2), ('2018', 3)]

## 28. Highest Target Under Manager
Find the highest target achieved by the employee or employees who works under the manager id 13. Output the first name of the employee and target achieved. The solution should show the highest target achieved under manager_id=13 and which employee(s) achieved it.

In [55]:
%%sql
WITH table1 AS (SELECT first_name,
                        target,
                        rank() OVER (ORDER BY target DESC) rnk
                FROM salesforce_employees
                WHERE manager_id = 13)
SELECT first_name,
        target
FROM table1
WHERE rnk = 1

[('Nicky', 400), ('Steve', 400), ('David', 400)]

In [56]:
%%sql
WITH table1 AS (SELECT first_name,
                        target,
                        manager_id,
                        RANK() OVER (PARTITION BY manager_id ORDER BY target DESC) rnk
                FROM salesforce_employees)
SELECT first_name,
        target
FROM table1
WHERE rnk = 1 AND manager_id = 13

[('Nicky', 400), ('Steve', 400), ('David', 400)]

In [57]:
%%sql
WITH table1 AS (SELECT MAX(target)
                FROM salesforce_employees
                WHERE manager_id = 13)
SELECT first_name,
        target
FROM salesforce_employees
WHERE target IN table1 AND manager_id = 13

[('Nicky', 400), ('Steve', 400), ('David', 400)]

## 29. Member Count

your query should return the names of the people who are reported to (excluding null values), the number of members that report to them, and the average age of those members as an integer. The rows should be ordered by the names in alphabetical order. Your output should look like the

In [58]:
%%sql
SELECT *
FROM member_count

[(1, 'Daniel', 'Smith', 'Bob Boss', 'Engineer', 25),
 (2, 'Mike', 'White', 'Bob Boss', 'Contractor', 22),
 (3, 'Jenny', 'Richards', None, 'CEO', 45),
 (4, 'Robert', 'Black', 'Daniel Smith', 'Sales', 22),
 (5, 'Noah', 'Fritz', 'Jenny Richards', 'Assistant', 30),
 (6, 'David', 'S', 'Jenny Richards', 'Director', 32),
 (7, 'Ashley', 'Wells', 'David S', 'Assistant', 25),
 (8, 'Ashley', 'Johnson', None, 'Intern', 25)]

In [59]:
%%sql
SELECT ReportsTo,
        count(ID) AS count_
FROM member_count
GROUP BY 1
HAVING ReportsTo IS NOT NULL

[('Bob Boss', 2), ('Daniel Smith', 1), ('David S', 1), ('Jenny Richards', 2)]

In [60]:
%%sql
SELECT ReportsTo,
        count(ID) AS count_
FROM member_count
WHERE ReportsTo IS NOT NULL
GROUP BY 1

[('Bob Boss', 2), ('Daniel Smith', 1), ('David S', 1), ('Jenny Richards', 2)]

## 30. User Logins
the table provided shows all new users signing up on a specific date in the format YYYY-MM-DD. Your query should output the change from one month to the next. Because the first month has no preceding month, your output should skip that row. Your output should look like the following table.

In [61]:
%%sql
with table1 as (SELECT  rtrim(substr("January  ,February ,March    ,April    ,May      ,June     ,July     ,August   ,September,October  ,November ,December ", cast(strftime("%m", DateJoined) AS int)*10 - 9, 9)) month_name,
                        strftime("%m", DateJoined) month_,
                        count(ID) current_count,
                        lag(count(ID),1) over (order by strftime("%m", DateJoined) asc) as prev_count
                FROM member_joined
                GROUP BY 1
                ORDER BY 2)

select month_name AS Month,
        current_count - prev_count AS MonthToMonthChange
FROM table1
WHERE prev_count IS NOT NULL

[('February', -1), ('March', 6), ('April', -6), ('May', 4)]

In [62]:
%%sql
SELECT  case when cast(strftime("%m", DateJoined) AS int) = 1 then 'January'
            when cast(strftime("%m", DateJoined) AS int) = 2 then 'February'
            when cast(strftime("%m", DateJoined) AS int) = 3 then 'March'
            when cast(strftime("%m", DateJoined) AS int) = 4 then 'April'
            when cast(strftime("%m", DateJoined) AS int) = 5 then 'May'
            end AS month,
        count(ID) - lag(count(ID),1) over (order by strftime("%m", DateJoined) asc) AS MonthToMonthChange
FROM member_joined
GROUP BY 1

[('January', None), ('February', -1), ('March', 6), ('April', -6), ('May', 4)]

## 31. Employee Salaries
your query should return the information for the employee with the third highest salary. Write a query that will find this employee and return that row, but then replace the DivisionID column with the corresponding DivisionName from the table cb_companydivisions. You should also replace the ManagerID column with the ManagerName if the ID exists in the table and is not NULL.

In [63]:
%%sql
SELECT *
FROM cb_salary

[(356, 'Daniel Smith', 100, 133.0, 40000),
 (122, 'Arnold Sully', 101, None, 60000),
 (467, 'Lisa Roberts', 100, None, 80000),
 (112, 'Mary Dial', 105, 467.0, 65000),
 (775, 'Dennis Front', 103, None, 90000),
 (111, 'Larry Weis', 104, 35534.0, 75000),
 (222, 'Mark Red', 102, 133.0, 86000),
 (577, 'Robert Night', 105, 12353.0, 76000),
 (133, 'Susan Wall', 105, 577.0, 110000)]

In [64]:
%%sql
SELECT *
FROM cb_companydivisions

[(100, 'Accounting'),
 (101, 'IT'),
 (102, 'Sales'),
 (103, 'Marketing'),
 (104, 'Engineering'),
 (105, 'Customer Support')]

In [65]:
%%sql
With table1 AS (SELECT ID AS Manager_ID,
                        Name AS Manager_Name
                FROM cb_salary),
        table2 AS (SELECT Name,
                        DivisionName,
                        Manager_Name,
                        Salary,
                        RANK() OVER(ORDER BY Salary DESC) rnk
                FROM cb_salary t1
                INNER JOIN cb_companydivisions t2
                ON t1.DivisionID = t2.ID
                LEFT JOIN table1 t3
                ON t3.Manager_ID = t1.ManagerID)

SELECT Name,
        DivisionName,
        Manager_Name,
        Salary
FROM table2
WHERE rnk = 3

[('Mark Red', 'Sales', 'Susan Wall', 86000)]

## 31.1. Employee Count By Divison

In [66]:
%%sql
SELECT t2.DivisionName,
        count(t1.ID) AS EmployeeCount
FROM cb_salary t1
INNER JOIN cb_companydivisions t2
ON t1.DivisionID = t2.ID
GROUP BY 1

[('Accounting', 2),
 ('Customer Support', 3),
 ('Engineering', 1),
 ('IT', 1),
 ('Marketing', 1),
 ('Sales', 1)]

## 31.2. Employees With Salary Higher Than Avg. Salary

In [67]:
%%sql
SELECT ID,
        Name
FROM cb_salary
WHERE salary > (SELECT AVG(salary) FROM cb_salary)

[(467, 'Lisa Roberts'),
 (775, 'Dennis Front'),
 (222, 'Mark Red'),
 (577, 'Robert Night'),
 (133, 'Susan Wall')]

## 31.3. Top Three Highest Salaries By Each Division

In [68]:
%%sql
WITH table1 AS (SELECT t1.ID,
                        t1.Name,
                        t2.DivisionName,
                        t1.salary,
                        RANK() OVER (PARTITION BY t2.DivisionName ORDER BY t1.salary DESC) AS rnk
                FROM cb_salary t1
                INNER JOIN cb_companydivisions t2
                ON t1.DivisionID = t2.ID)
SELECT ID,
        Name,
        DivisionName,
        rnk AS Order_,
        salary
FROM table1
WHERE rnk <= 3
ORDER BY 3,4

[(467, 'Lisa Roberts', 'Accounting', 1, 80000),
 (356, 'Daniel Smith', 'Accounting', 2, 40000),
 (133, 'Susan Wall', 'Customer Support', 1, 110000),
 (577, 'Robert Night', 'Customer Support', 2, 76000),
 (112, 'Mary Dial', 'Customer Support', 3, 65000),
 (111, 'Larry Weis', 'Engineering', 1, 75000),
 (122, 'Arnold Sully', 'IT', 1, 60000),
 (775, 'Dennis Front', 'Marketing', 1, 90000),
 (222, 'Mark Red', 'Sales', 1, 86000)]

## 32. Vendor Sort
your query should return the vendor information along with the values from the table cb_vendorinformation. You should combine the values of the two tables based on the GroupID column. The final query should consolidate the rows to be grouped by FirstName, and a Count column should be added at the end that adds up the number of times that person shows up in the table.       
The output table should be sorted by the Count column in ascending order and then sorted by CompanyName in alphabetical order.

In [69]:
%%sql
SELECT *
FROM cb_vendorinformation

[(35, 'Shipping & Co.'),
 (36, 'Johnson and Sons'),
 (39, 'News Corp.'),
 (40, 'FireConsulting'),
 (5, 'WaterBus Enterprise'),
 (6, 'Alloy LLC'),
 (27, 'Machinx')]

In [70]:
%%sql
SELECT *
FROM cb_vendor

[(35, 2018.0, 102.0, 'Daniel', 'Knolle', 'Manager', 39765.0, 'West'),
 (35, 2018.0, 1988.0, 'Arnold', 'Sully', 'Manager', 48507.0, 'West'),
 (35, 2018.0, 1988.0, 'Arnold', 'Sully', 'Manager', 48507.0, 'East'),
 (36, 2018.0, 102.0, 'Daniel', 'Knolle', 'Manager', 8219.0, 'West'),
 (36, 2018.0, 1988.0, 'Arnold', 'Sully', 'Manager', 48507.0, 'West'),
 (39, 2018.0, 102.0, 'Daniel', 'Knolle', 'Manager', 8219.0, 'West'),
 (39, 2018.0, 102.0, 'Daniel', 'Knolle', 'Manager', 39765.0, 'West'),
 (39, 2018.0, 650.0, 'Lisa', 'Roberts', 'Manager', 1860.0, 'West'),
 (39, 2018.0, 650.0, 'Lisa', 'Roberts', 'Manager', 5397.0, 'Central'),
 (39, 2018.0, 1988.0, 'Arnold', 'Sully', 'Manager', 48507.0, 'West'),
 (39, 2018.0, 12.0, 'Mary', 'Dial', 'Manager', 1860.0, 'East'),
 (40, 2019.0, 102.0, 'Daniel', 'Knolle', 'Manager', 8219.0, 'East'),
 (40, 2019.0, 102.0, 'Daniel', 'Knolle', 'Manager', 39765.0, 'West'),
 (40, 2019.0, 650.0, 'Lisa', 'Roberts', 'Manager', 1860.0, 'West'),
 (40, 2019.0, 1988.0, 'Arnold', 'Sully', 'Manager', 39765.0, 'West'),
 (40, 2019.0, 1988.0, 'Arnold', 'Sully', 'Manager', 48507.0, 'West'),
 (5, 2012.0, 478.0, 'Dennis', 'S', 'Contractor', 24122.0, 'North'),
 (6, 2012.0, 478.0, 'Dennis', 'S', 'Contractor', 10272.0, 'North'),
 (6, None, None, 'Larry', 'Weis', 'Contractor', 4219.0, None),
 (6, None, None, 'Larry', 'Weis', 'Contractor', None, None),
 (27, None, None, 'Mary', 'Dial', 'Manager', None, None)]

In [71]:
%%sql
SELECT t1.GroupID,
        FirstName,
        LastName,
        Job,
        ExternalID,
        CompanyName,
        Count(*) count
FROM cb_vendor t1
LEFT JOIN cb_vendorinformation t2
ON t1.GroupID = t2.GroupID
GROUP BY FirstName,
        LastName
ORDER BY count ASC,CompanyName

[(6, 'Larry', 'Weis', 'Contractor', 4219.0, 'Alloy LLC', 2),
 (39, 'Mary', 'Dial', 'Manager', 1860.0, 'News Corp.', 2),
 (5, 'Dennis', 'S', 'Contractor', 24122.0, 'WaterBus Enterprise', 2),
 (39, 'Lisa', 'Roberts', 'Manager', 1860.0, 'News Corp.', 3),
 (35, 'Arnold', 'Sully', 'Manager', 48507.0, 'Shipping & Co.', 6),
 (35, 'Daniel', 'Knolle', 'Manager', 39765.0, 'Shipping & Co.', 6)]

## 33. Vendor Join
In this MySQL challenge, your query should return the vendor information along with the values from the table cb_vendorinformation. You should combine the values of the two tables based on the GroupID column. The final query should only print out the GroupID, CompanyName, and final count of all rows that are grouped into each compan name under a column titled Count. The output table should be then sorted by the Count column and then sorted by GroupID so that a higher number appears first.

In [72]:
%%sql
SELECT t1.GroupID,
        CompanyName,
        Count(*) count
FROM cb_vendor t1
LEFT JOIN cb_vendorinformation t2
ON t1.GroupID = t2.GroupID
GROUP BY 1
ORDER BY count ASC,t1.GroupID DESC

[(27, 'Machinx', 1),
 (5, 'WaterBus Enterprise', 1),
 (36, 'Johnson and Sons', 2),
 (35, 'Shipping & Co.', 3),
 (6, 'Alloy LLC', 3),
 (40, 'FireConsulting', 5),
 (39, 'News Corp.', 6)]